# DS 2002 Midterm

**This file should be executed within the DS 2002 Azure class virtual computer**

## Deliverable 1: Design a dimensional data mart that represents a simple business process of your choosing.
   ### a. 
   Retail sales
   ### b. 
   Sakila MySQL database - Business process is sales at a movie rental store
   
## Deliverable 2: Develop an ETL pipeline that extracts, transforms and loads data into your data mart.
   ### a. Extract data from one or more SQL database tables; hosted locally or in the Cloud.
   ### *Extracting the customers and staff tables from MySQL workbench relational database (on the local virtual computer)*

#### Importing Libraries
Before importing, make sure these are on your machine. If they aren't, open a terminal and install them.

In [26]:
import os
import json
import numpy
import datetime
import pprint
import requests
import requests.exceptions
import pandas as pd
import pymongo
from sqlalchemy import create_engine

#### Declaring and assigning connection variables to use with MySQL server and the Sakila database

In [2]:
host_name = "localhost"
port = "3306"
user_id = "root"
pwd = "Passw0rd123"

src_dbname = "sakila" # source database to grabbing info from
dst_dbname = "sakila_dw2" # data mart I am creating

#### Defining functions for getting data from a database and setting data into a database

In [3]:
# this fn connects to MySQL database to get data from it and creates a dataframe
def get_dataframe(user_id, pwd, host_name, db_name, sql_query):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}" # the at sign means we cannot put an @ in our password to the connection
    sqlEngine = create_engine(conn_str, pool_recycle=3600) # pool recycle quits command if it takes too long
    connection = sqlEngine.connect() #this returns an instance of a connection to the MySQL server
    dframe = pd.read_sql(sql_query, connection); #this uses Pandas to make a dataframe using sql query
    connection.close() # close connection to conserve resources
    
    return dframe

# this fn creates a new table in MySQL using the Pandas dataframe we created using the get_dataframe fn
def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    if db_operation == "insert": # to insert new table
        df.to_sql(table_name, con=connection, index=False, if_exists='replace') # if_exists=replace will drop the table if it already exists
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update": # to update an old table
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Creating the new data warehouse database and using it to switch the connection context

In [4]:
# creates connection to MySQL
conn_str = f"mysql+pymysql://{user_id}:{pwd}@{host_name}"
sqlEngine = create_engine(conn_str, pool_recycle=3600)

# this empties the database if it exists, creates a fresh one, and then sets following code to use the new database
sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

### EXTRACT
#### Extracting data from the source database tables

In [5]:
sql_customers = "SELECT * FROM sakila.customer;"
df_customers = get_dataframe(user_id, pwd, host_name, src_dbname, sql_customers) # makes dataframe for the sakila customers
df_customers.head(2) # check if it worked

,customer_id,store_id,first_name,last_name,email,address_id,active,create_date,last_update
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1,2006-02-14 22:04:36,2006-02-15 04:57:20
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1,2006-02-14 22:04:36,2006-02-15 04:57:20

In [6]:
sql_staff = "SELECT * FROM sakila.staff;"
df_staff = get_dataframe(user_id, pwd, host_name, src_dbname, sql_staff) # makes dataframe for sakila staff
df_staff.head(2)

,staff_id,first_name,last_name,address_id,picture,email,store_id,active,username,password,last_update
0,1,Mike,Hillyer,3,b'\x89PNG\r\n\x1a\n\x00\x00\x00\rIHDR\x00\x00\...,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964,2006-02-15 03:57:16
1,2,Jon,Stephens,4,None,Jon.Stephens@sakilastaff.com,2,1,Jon,None,2006-02-15 03:57:16

### TRANSFORM
#### Transforming data to drop unnecessary columns and rename the primary key

In [7]:
drop_cols = ['create_date','last_update'] # this list has the cols we have deemed unnecessary and want to drop
df_customers.drop(drop_cols, axis=1, inplace=True) # this drops the cols in the drop_cols list we made above from the df_customers dataframe. Axis=0 (is rows) and axis=1 (is cols). Inplace=TRUE makes modification to df directly instead of making a copy of it.
df_customers.rename(columns={"customer_id":"customer_key"}, inplace=True) # renames columns called id as customer_key

df_customers.head(2)

,customer_key,store_id,first_name,last_name,email,address_id,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,5,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,6,1

In [8]:
drop_cols = ['picture','last_update']
df_staff.drop(drop_cols, axis=1, inplace=True)
df_staff.rename(columns={"staff_id":"staff_key"}, inplace=True)

df_staff.head(2)

,staff_key,first_name,last_name,address_id,email,store_id,active,username,password
0,1,Mike,Hillyer,3,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964
1,2,Jon,Stephens,4,Jon.Stephens@sakilastaff.com,2,1,Jon,None

### LOAD
#### Loading the transformed dataframes into the new data warehouse by creating new tables

In [9]:
db_operation = "insert"

# tables is a list containing vectors that act as a row that creates a table for each dataframe we made (see above description)
tables = [('dim_customers', df_customers, 'customer_key'), # third argument sets the primary key for the table
          ('dim_staff', df_staff, 'staff_key')]

for table_name, dataframe, primary_key in tables:
    set_dataframe(user_id, pwd, host_name, dst_dbname, dataframe, table_name, primary_key, db_operation)

   ### *Extracting the store and inventory tables from MongoDB NoSQL database (from JSON files located in the data folder in Jupyter and using my Atlas account)*

#### Delcaring and assigning connection varables for the MongoDB server, MySQL server, and the databases

In [21]:
mysql_uid = "root"
mysql_pwd = "Passw0rd123"
#mysql_host = "ds2002-mysql.mysql.database.azure.com"

atlas_cluster_name = "sandbox.den9rfu"
atlas_user_name = "ecm8yu"
atlas_password = "HR91sK8EWrAUzWRM"

conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_user_name}:{atlas_password}@{atlas_cluster_name}.mongodb.net"
}

src_dbname = "sakila_renting"
dst_dbname = "sakila_dw2"

print(f"Local Connection String: {conn_str['local']}")
print(f"Atlas Connection String: {conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://ecm8yu:HR91sK8EWrAUzWRM@sandbox.den9rfu.mongodb.net

#### Defining functions for getting data from databases and putting data into databases

In [11]:
def get_sql_dataframe(user_id, pwd, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(connect_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(connect_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{user_id}:{pwd}@localhost/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

#### Setting up NoSQL environment - Populating MongoDB with source data

In [12]:
client = pymongo.MongoClient(conn_str["atlas"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"inventory" : 'sakila_inventory.json',
              "stores" : 'sakila_store.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile) #turns JSON string file into an object
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

### EXTRACT
#### Extracting data from the source MongoDB collections into dataframes

In [13]:
query = {}
collection = "inventory"

df_inventory = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_inventory.head(2)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17

In [14]:
query = {}
collection = "stores"

df_stores = get_mongo_dataframe(conn_str['atlas'], src_dbname, collection, query)
df_stores.head(2)

   store_id  manager_staff_id  address_id          last_update
0         1                 1           1  2006-02-15 04:57:12
1         2                 2           2  2006-02-15 04:57:12

### TRANSFORM
#### Making necessary transformations

In [42]:
drop_cols = ['last_update']
df_inventory.drop(drop_cols, axis=1, inplace=True)
df_inventory.rename(columns={"inventory_id":"inventory_key"}, inplace=True)
df_inventory.head(2)

   inventory_key  film_id  store_id
0              1        1         1
1              2        1         1

In [43]:
drop_cols = ['last_update']
df_stores.drop(drop_cols, axis=1, inplace=True)
df_stores.rename(columns={"store_id":"store_key"}, inplace=True)
df_stores.head(2)

   store_key  manager_staff_id  address_id
0          1                 1           1
1          2                 2           2

### LOAD
#### Loading the transformed dataframes into the new data warehouse by creating new tables

In [22]:
dataframe = df_inventory
table_name = 'dim_inventory'
primary_key = 'inventory_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [23]:
dataframe = df_stores
table_name = 'dim_stores'
primary_key = 'store_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### Validating the store and inventory dimension tables were created

In [24]:
sql_inventory = "SELECT * FROM sakila_dw2.dim_inventory;"
df_dim_inventory = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_inventory)
df_dim_inventory.head(2)

   inventory_key  film_id  store_id          last_update
0              1        1         1  2006-02-15 05:09:17
1              2        1         1  2006-02-15 05:09:17

In [25]:
sql_stores = "SELECT * FROM sakila_dw2.dim_stores;"
df_dim_stores = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_stores)
df_dim_stores.head(2)

   store_key  manager_staff_id  address_id          last_update
0          1                 1           1  2006-02-15 04:57:12
1          2                 2           2  2006-02-15 04:57:12

   ### *Extacting the payment and rental tables from local file system (file is contained in zip of my Midterm repo)*

### EXTRACT
#### Extracting data from JSON file

In [34]:
data_dir = os.path.join(os.getcwd(), 'data')
data_file = os.path.join(data_dir, 'sakila_rental.csv')

df_rentals = pd.read_csv(data_file, sep=';', header=0, index_col=None)
df_rentals.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53

In [35]:
data_dir = os.path.join(os.getcwd(), 'data')
data_file = os.path.join(data_dir, 'sakila_payment.csv')

df_payments = pd.read_csv(data_file, sep=';', header=0, index_col=None)
df_payments.head()

,payment_id,customer_id,staff_id,rental_id,amount,payment_date,last_update
0,1,1,1,76,2.99,2005-05-25 11:30:37,2006-02-15 22:12:30
1,2,1,1,573,0.99,2005-05-28 10:35:23,2006-02-15 22:12:30
2,3,1,1,1185,5.99,2005-06-15 00:54:12,2006-02-15 22:12:30
3,4,1,2,1422,0.99,2005-06-15 18:02:53,2006-02-15 22:12:30
4,5,1,2,1476,9.99,2005-06-15 21:08:46,2006-02-15 22:12:30

### TRANSFORM
#### Transforming to remove unnecessary columns

In [36]:
drop_cols = ['last_update']
df_rentals.drop(drop_cols, axis=1, inplace=True)
df_rentals.rename(columns={"rental_id":"rental_key"}, inplace=True)

df_rentals.head(2)

,rental_key,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [37]:
drop_cols = ['last_update']
df_payments.drop(drop_cols, axis=1, inplace=True)
df_payments.rename(columns={"payment_id":"payment_key"}, inplace=True)

df_payments.head(2)

   payment_key  customer_id  staff_id  rental_id  amount         payment_date
0            1            1         1         76    2.99  2005-05-25 11:30:37
1            2            1         1        573    0.99  2005-05-28 10:35:23

### LOAD
#### Loading data into MySQL using the previously used set_dataframe function

In [38]:
dataframe = df_rentals
table_name = 'dim_rentals'
primary_key = 'rental_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

In [39]:
dataframe = df_payments
table_name = 'dim_payments'
primary_key = 'payment_key'
db_operation = "insert"

set_dataframe(mysql_uid, mysql_pwd, dst_dbname, dataframe, table_name, primary_key, db_operation)

#### Validating the rental and payment dimension tables were created

In [40]:
sql_rentals = "SELECT * FROM sakila_dw2.dim_rentals;"
df_dim_rentals = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_rentals)
df_dim_rentals.head(2)

,rental_key,rental_date,inventory_id,customer_id,return_date,staff_id
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1

In [41]:
sql_payments = "SELECT * FROM sakila_dw2.dim_payments;"
df_dim_payments = get_sql_dataframe(mysql_uid, mysql_pwd, dst_dbname, sql_payments)
df_dim_payments.head(2)

   payment_key  customer_id  staff_id  rental_id  amount         payment_date
0            1            1         1         76    2.99  2005-05-25 11:30:37
1            2            1         1        573    0.99  2005-05-28 10:35:23